import numpy as np
import pandas as pd

#读表
TA = pd.read_csv('D:\gxt\hxq\TA.csv',encoding='gbk')
#删除重复行
TA = TA.drop_duplicates()
lieming =['所属地市', '所属区县', '网格', '日期', 'CGI', '网格.1', '覆盖TA', '0.98*时间提前量采样点总数',
       '时间提前量采样点总数', '时间提前量_00 [0，78)', '时间提前量_01 [78，156)',
       '时间提前量_02 [156，235)', '时间提前量_03 [235，313)', '时间提前量_04 [313，391)',
       '时间提前量_05 [391，469)', '时间提前量_06 [469，548)', '时间提前量_07 [548，626)',
       '时间提前量_08 [626，704)', '时间提前量_09 [704，782)', '时间提前量_10 [782，861)',
       '时间提前量_11 [861，939)', '时间提前量_12 [939，1095)', '时间提前量_13 [1095，1252)',
       '时间提前量_14 [1252，1408)', '时间提前量_15 [1408，1565)', '时间提前量_16 [1565，1721)',
       '时间提前量_17 [1721，1878)', '时间提前量_18 [1878，2034)', '时间提前量_19 [2034，2191)',
       '时间提前量_20 [2191，2347)', '时间提前量_21 [2347，2504)', '时间提前量_22 [2504，2660)',
       '时间提前量_23 [2660，2817)', '时间提前量_24 [2817，2973)', '时间提前量_25 [2973，3130)',
       '时间提前量_26 [3130，3286)', '时间提前量_27 [3286，3443)', '时间提前量_28 [3443，3599)',
       '时间提前量_29 [3599，3756)', '时间提前量_30 [3756，3912)', '时间提前量_31 [3912，4068)',
       '时间提前量_32 [4068，4225)', '时间提前量_33 [4225，4381)', '时间提前量_34 [4381，4538)',
       '时间提前量_35 [4538，4694)', '时间提前量_36 [4694，4851)', '时间提前量_37 [4851，5007)',
       '时间提前量_38 [5007，6259)', '时间提前量_39 [6259，7511)', '时间提前量_40 [7511，8763)',
       '时间提前量_41 [8763，10015)', '时间提前量_42 [10015，15022)',
       '时间提前量_43 [15022，20029)', '时间提前量_44 [20029，+∞)', '0.98*时间提前量采样点总数率']
#构造输出结果表
Result = pd.DataFrame(columns=lieming)
#将数据转换成float型
TA['时间提前量采样点总数'] = TA['时间提前量采样点总数'].astype(np.float64)
#选取时间提前量采样点总数不等于0的行
TA = TA.loc[(TA['时间提前量采样点总数']!=0)]
#查看总行数
print(TA.iloc[:,0].size)
# n用于计算"0.98*时间提前量采样点总数"
n = 10
while n <=54:
    TA1 = TA
    #计算“时间提前量_00 [0，78)”至n-1列的采样点总数
    TA1['0.98*时间提前量采样点总数'] = TA.ix[:,9:n].apply(lambda x: x.sum(),axis=1)
    #选取CGI，'0.98*时间提前量采样点总数'列
    TA1 =TA1[['CGI','0.98*时间提前量采样点总数']]
    #通过CGI把表TA1中的'0.98*时间提前量采样点总数'列并入表TA（vlookup功能）
    TA = pd.merge(TA,TA1,on='CGI',how='left',suffixes=('', '_y'))
    #删除由上步操作多出的列
    TA.drop(['0.98*时间提前量采样点总数_y'], axis=1, inplace=True)
    TA['0.98*时间提前量采样点总数率'] = TA['0.98*时间提前量采样点总数']*1.0/TA['时间提前量采样点总数']
    TA_temp1 = TA.loc[(TA['0.98*时间提前量采样点总数率']>=0.98)]
    TA_temp1['覆盖TA'] = 'TA'+str(n-10)
    #把结果放入表Result中
    Result = Result.append(TA_temp1)
    #删除已经存入表Result中的行
    TA = TA.loc[(~TA['CGI'].isin(TA_temp1['CGI']))]
    n=n+1

print(n)
#查看输出结果表的总行数，可以验证中间是否有数据丢失
print(Result.iloc[:,0].size)
# print(Result.columns)
#将结果存在csv中
Result.to_csv('D:\gxt\hxq\TA1.csv',header=1,encoding='gbk',index=False)